#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.mydatabase will be created
  + resource "helm_release" "mydatabase" {
      + atomic                     = false
      + chart                      = "stable/mariadb"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "mydatabase"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true

      + set {
          + name  = "mariadbPassword"
          + value = "qux"
        }
      + set {
          + name  = "mariadbUser"
          + value = "foo"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave2`, Workspace: `default`*
